---
kind: method
id: M:Autodesk.Revit.UI.ThinLinesOptions.Dispose
source: html/b5ec245e-a8ee-d441-1c79-be5b5a7a061f.htm
---
# Autodesk.Revit.UI.ThinLinesOptions.Dispose Method

Releases all resources used by the ThinLinesOptions

## Syntax (C#)
```csharp
public void Dispose()
```